#if 0
;
; Note: shader requires additional functionality:
;       64 UAV slots
;       Typed UAV Load Additional Formats
;
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: fa836ddaa71a8d50991b13ef3c687f85.pdb
; shader hash: fa836ddaa71a8d50991b13ef3c687f85
;
; Pipeline Runtime Information: 
;
; Compute Shader
; NumThreads=(32,32,1)
;
;
; Buffer Definitions:
;
; cbuffer GlobalsVS
; {
;
;   struct hostlayout.GlobalsVS
;   {
;
;       row_major float4x4 g_MtxProjection;           ; Offset:    0
;       row_major float4x4 g_MtxView;                 ; Offset:   64
;       row_major float4x4 g_MtxWorld;                ; Offset:  128
;       row_major float4x4 g_MtxWorldIT;              ; Offset:  192
;       row_major float4x4 g_MtxPrevWorld;            ; Offset:  320
;       row_major float4x4 g_MtxLightViewProjection;  ; Offset:  384
;       row_major float3x4 g_MtxPalette[25];          ; Offset:  448
;       row_major float3x4 g_MtxPrevPalette[25];      ; Offset: 1648
;       float4 g_EyePosition;                         ; Offset: 2848
;       float4 g_EyeDirection;                        ; Offset: 2864

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.7.2308.7 (69e54e290)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !23, globals: !74)
!1 = !DIFile(filename: "ResolveComputeShader.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 17, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 17, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 17, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 109, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 109, size: 64, align: 32, elements: !18, templateParams: !21)
!18 = !{!19, !20}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 109, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, line: 109, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !{!13, !22}
!22 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!23 = !{!24, !37, !67, !71}
!24 = !DISubprogram(name: "main", scope: !1, file: !1, line: 5, type: !25, isLocal: false, isDefinition: true, scopeLine: 6, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!25 = !DISubroutineType(types: !26)
!26 = !{null, !27}
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 110, baseType: !28)
!28 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 110, size: 96, align: 32, elements: !29, templateParams: !34)
!29 = !{!30, !32, !33}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !28, file: !1, line: 110, baseType: !31, size: 32, align: 32, flags: DIFlagPublic)
!31 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !28, file: !1, line: 110, baseType: !31, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !28, file: !1, line: 110, baseType: !31, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!34 = !{!35, !36}
!35 = !DITemplateTypeParameter(name: "element", type: !31)
!36 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!37 = !DISubprogram(name: "LoadGBufferData", linkageName: "\01?LoadGBufferData@@YA?AUGBufferData@@V?$vector@I$01@@@Z", scope: !38, file: !38, line: 375, type: !39, isLocal: false, isDefinition: true, scopeLine: 376, flags: DIFlagPrototyped, isOptimized: false)
!38 = !DIFile(filename: "./GBufferData.hlsli", directory: "")
!39 = !DISubroutineType(types: !40)
!40 = !{!41, !61}
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "GBufferData", file: !38, line: 15, size: 704, align: 32, elements: !42)
!42 = !{!43, !51, !53, !54, !55, !56, !57, !58, !59, !60}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !41, file: !38, line: 17, baseType: !44, size: 96, align: 32)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 107, baseType: !45)
!45 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 107, size: 96, align: 32, elements: !46, templateParams: !50)
!46 = !{!47, !48, !49}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !45, file: !1, line: 107, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !45, file: !1, line: 107, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !45, file: !1, line: 107, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!50 = !{!13, !36}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !41, file: !38, line: 18, baseType: !52, size: 32, align: 32, offset: 96)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 108, baseType: !31)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "Normal", scope: !41, file: !38, line: 19, baseType: !44, size: 96, align: 32, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !41, file: !38, line: 20, baseType: !44, size: 96, align: 32, offset: 224)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "Alpha", scope: !41, file: !38, line: 21, baseType: !8, size: 32, align: 32, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !41, file: !38, line: 22, baseType: !44, size: 96, align: 32, offset: 352)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "SpecularPower", scope: !41, file: !38, line: 23, baseType: !8, size: 32, align: 32, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "SpecularLevel", scope: !41, file: !38, line: 24, baseType: !8, size: 32, align: 32, offset: 480)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "Emission", scope: !41, file: !38, line: 25, baseType: !44, size: 96, align: 32, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "Falloff", scope: !41, file: !38, line: 26, baseType: !44, size: 96, align: 32, offset: 608)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 110, baseType: !62)
!62 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 110, size: 64, align: 32, elements: !63, templateParams: !66)
!63 = !{!64, !65}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !62, file: !1, line: 110, baseType: !31, size: 32, align: 32, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !62, file: !1, line: 110, baseType: !31, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!66 = !{!35, !22}
!67 = !DISubprogram(name: "ComputeDirectLighting", linkageName: "\01?ComputeDirectLighting@@YA?AV?$vector@M$02@@UGBufferData@@V1@111@Z", scope: !68, file: !68, line: 6, type: !69, isLocal: false, isDefinition: true, scopeLine: 8, flags: DIFlagPrototyped, isOptimized: false)
!68 = !DIFile(filename: "./GeometryShading.hlsli", directory: "")
!69 = !DISubroutineType(types: !70)
!70 = !{!44, !41, !44, !44, !44, !44}
!71 = !DISubprogram(name: "ComputeLightScattering", linkageName: "\01?ComputeLightScattering@@YA?AV?$vector@M$01@@V?$vector@M$02@@0@Z", scope: !68, file: !68, line: 28, type: !72, isLocal: false, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: false)
!72 = !DISubroutineType(types: !73)
!73 = !{!16, !44, !44}
!74 = !{!75, !100, !101, !102, !103, !104, !105, !127, !128, !130, !131, !132, !133, !134, !135, !136, !137, !138, !142, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !222, !224, !226, !228, !230, !251, !285, !289, !292, !296, !297, !301, !302, !303, !304, !305, !306, !307, !308, !309}
!75 = !DIGlobalVariable(name: "g_MtxProjection", linkageName: "\01?g_MtxProjection@GlobalsVS@@3V?$matrix@M$03$03@@B", scope: !0, file: !76, line: 9, type: !77, isLocal: false, isDefinition: true)
!76 = !DIFile(filename: "./RootSignature.hlsli", directory: "")
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 9, baseType: !79)
!79 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 9, size: 512, align: 32, elements: !80, templateParams: !97)
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !79, file: !1, line: 9, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !79, file: !1, line: 9, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !79, file: !1, line: 9, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !79, file: !1, line: 9, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !79, file: !1, line: 9, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !79, file: !1, line: 9, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !79, file: !1, line: 9, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !79, file: !1, line: 9, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !79, file: !1, line: 9, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !79, file: !1, line: 9, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !79, file: !1, line: 9, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !79, file: !1, line: 9, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !79, file: !1, line: 9, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !79, file: !1, line: 9, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !79, file: !1, line: 9, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !79, file: !1, line: 9, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!97 = !{!13, !98, !99}
!98 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!99 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!100 = !DIGlobalVariable(name: "g_MtxView", linkageName: "\01?g_MtxView@GlobalsVS@@3V?$matrix@M$03$03@@B", scope: !0, file: !76, line: 10, type: !77, isLocal: false, isDefinition: true)
!101 = !DIGlobalVariable(name: "g_MtxWorld", linkageName: "\01?g_MtxWorld@GlobalsVS@@3V?$matrix@M$03$03@@B", scope: !0, file: !76, line: 11, type: !77, isLocal: false, isDefinition: true)
!102 = !DIGlobalVariable(name: "g_MtxWorldIT", linkageName: "\01?g_MtxWorldIT@GlobalsVS@@3V?$matrix@M$03$03@@B", scope: !0, file: !76, line: 12, type: !77, isLocal: false, isDefinition: true)
!103 = !DIGlobalVariable(name: "g_MtxPrevWorld", linkageName: "\01?g_MtxPrevWorld@GlobalsVS@@3V?$matrix@M$03$03@@B", scope: !0, file: !76, line: 13, type: !77, isLocal: false, isDefinition: true)
!104 = !DIGlobalVariable(name: "g_MtxLightViewProjection", linkageName: "\01?g_MtxLightViewProjection@GlobalsVS@@3V?$matrix@M$03$03@@B", scope: !0, file: !76, line: 14, type: !77, isLocal: false, isDefinition: true)
!105 = !DIGlobalVariable(name: "g_MtxPalette", linkageName: "\01?g_MtxPalette@GlobalsVS@@3QBV?$matrix@M$02$03@@B", scope: !0, file: !76, line: 15, type: !106, isLocal: false, isDefinition: true)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 9600, align: 32, elements: !125)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x4", file: !1, line: 15, baseType: !109)
!109 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 4>", file: !1, line: 15, size: 384, align: 32, elements: !110, templateParams: !123)
!110 = !{!111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !109, file: !1, line: 15, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !109, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !109, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !109, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !109, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !109, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !109, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !109, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !109, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !109, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !109, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !109, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!123 = !{!13, !124, !99}
!124 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 3)
!125 = !{!126}
!126 = !DISubrange(count: 25)
!127 = !DIGlobalVariable(name: "g_MtxPrevPalette", linkageName: "\01?g_MtxPrevPalette@GlobalsVS@@3QBV?$matrix@M$02$03@@B", scope: !0, file: !76, line: 16, type: !106, isLocal: false, isDefinition: true)
!128 = !DIGlobalVariable(name: "g_EyePosition", linkageName: "\01?g_EyePosition@GlobalsVS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 17, type: !129, isLocal: false, isDefinition: true)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!130 = !DIGlobalVariable(name: "g_EyeDirection", linkageName: "\01?g_EyeDirection@GlobalsVS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 18, type: !129, isLocal: false, isDefinition: true)
!131 = !DIGlobalVariable(name: "g_ViewportSize", linkageName: "\01?g_ViewportSize@GlobalsVS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 19, type: !129, isLocal: false, isDefinition: true)
!132 = !DIGlobalVariable(name: "g_CameraNearFarAspect", linkageName: "\01?g_CameraNearFarAspect@GlobalsVS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 20, type: !129, isLocal: false, isDefinition: true)
!133 = !DIGlobalVariable(name: "mrgAmbientColor", linkageName: "\01?mrgAmbientColor@GlobalsVS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 21, type: !129, isLocal: false, isDefinition: true)
!134 = !DIGlobalVariable(name: "mrgGlobalLight_Direction", linkageName: "\01?mrgGlobalLight_Direction@GlobalsVS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 22, type: !129, isLocal: false, isDefinition: true)
!135 = !DIGlobalVariable(name: "mrgGlobalLight_Diffuse", linkageName: "\01?mrgGlobalLight_Diffuse@GlobalsVS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 23, type: !129, isLocal: false, isDefinition: true)
!136 = !DIGlobalVariable(name: "mrgGlobalLight_Specular", linkageName: "\01?mrgGlobalLight_Specular@GlobalsVS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 24, type: !129, isLocal: false, isDefinition: true)
!137 = !DIGlobalVariable(name: "mrgGIAtlasParam", linkageName: "\01?mrgGIAtlasParam@GlobalsVS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 25, type: !129, isLocal: false, isDefinition: true)
!138 = !DIGlobalVariable(name: "mrgTexcoordIndex", linkageName: "\01?mrgTexcoordIndex@GlobalsVS@@3QBV?$vector@M$03@@B", scope: !0, file: !76, line: 26, type: !139, isLocal: false, isDefinition: true)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 512, align: 32, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 4)
!142 = !DIGlobalVariable(name: "mrgTexcoordOffset", linkageName: "\01?mrgTexcoordOffset@GlobalsVS@@3QBV?$vector@M$03@@B", scope: !0, file: !76, line: 27, type: !143, isLocal: false, isDefinition: true)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 256, align: 32, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 2)
!146 = !DIGlobalVariable(name: "mrgFresnelParam", linkageName: "\01?mrgFresnelParam@GlobalsVS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 28, type: !129, isLocal: false, isDefinition: true)
!147 = !DIGlobalVariable(name: "mrgMorphWeight", linkageName: "\01?mrgMorphWeight@GlobalsVS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 29, type: !129, isLocal: false, isDefinition: true)
!148 = !DIGlobalVariable(name: "mrgZOffsetRate", linkageName: "\01?mrgZOffsetRate@GlobalsVS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 30, type: !129, isLocal: false, isDefinition: true)
!149 = !DIGlobalVariable(name: "g_IndexCount", linkageName: "\01?g_IndexCount@GlobalsVS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 31, type: !129, isLocal: false, isDefinition: true)
!150 = !DIGlobalVariable(name: "g_LightScattering_Ray_Mie_Ray2_Mie2", linkageName: "\01?g_LightScattering_Ray_Mie_Ray2_Mie2@GlobalsVS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 32, type: !129, isLocal: false, isDefinition: true)
!151 = !DIGlobalVariable(name: "g_LightScattering_ConstG_FogDensity", linkageName: "\01?g_LightScattering_ConstG_FogDensity@GlobalsVS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 33, type: !129, isLocal: false, isDefinition: true)
!152 = !DIGlobalVariable(name: "g_LightScatteringFarNearScale", linkageName: "\01?g_LightScatteringFarNearScale@GlobalsVS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 34, type: !129, isLocal: false, isDefinition: true)
!153 = !DIGlobalVariable(name: "g_LightScatteringColor", linkageName: "\01?g_LightScatteringColor@GlobalsVS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 35, type: !129, isLocal: false, isDefinition: true)
!154 = !DIGlobalVariable(name: "g_LightScatteringMode", linkageName: "\01?g_LightScatteringMode@GlobalsVS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 36, type: !129, isLocal: false, isDefinition: true)
!155 = !DIGlobalVariable(name: "g_MtxBillboardY", linkageName: "\01?g_MtxBillboardY@GlobalsVS@@3V?$matrix@M$03$03@@B", scope: !0, file: !76, line: 37, type: !77, isLocal: false, isDefinition: true)
!156 = !DIGlobalVariable(name: "mrgLocallightIndexArray", linkageName: "\01?mrgLocallightIndexArray@GlobalsVS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 38, type: !129, isLocal: false, isDefinition: true)
!157 = !DIGlobalVariable(name: "g_MtxVerticalLightViewProjection", linkageName: "\01?g_MtxVerticalLightViewProjection@GlobalsVS@@3V?$matrix@M$03$03@@B", scope: !0, file: !76, line: 39, type: !77, isLocal: false, isDefinition: true)
!158 = !DIGlobalVariable(name: "g_VerticalLightDirection", linkageName: "\01?g_VerticalLightDirection@GlobalsVS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 40, type: !129, isLocal: false, isDefinition: true)
!159 = !DIGlobalVariable(name: "g_TimeParam", linkageName: "\01?g_TimeParam@GlobalsVS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 41, type: !129, isLocal: false, isDefinition: true)
!160 = !DIGlobalVariable(name: "g_aLightField", linkageName: "\01?g_aLightField@GlobalsVS@@3QBV?$vector@M$03@@B", scope: !0, file: !76, line: 42, type: !161, isLocal: false, isDefinition: true)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 768, align: 32, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 6)
!164 = !DIGlobalVariable(name: "g_SkyParam", linkageName: "\01?g_SkyParam@GlobalsVS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 43, type: !129, isLocal: false, isDefinition: true)
!165 = !DIGlobalVariable(name: "g_ViewZAlphaFade", linkageName: "\01?g_ViewZAlphaFade@GlobalsVS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 44, type: !129, isLocal: false, isDefinition: true)
!166 = !DIGlobalVariable(name: "g_PowerGlossLevel", linkageName: "\01?g_PowerGlossLevel@GlobalsVS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 45, type: !129, isLocal: false, isDefinition: true)
!167 = !DIGlobalVariable(name: "g_MtxInvProjection", linkageName: "\01?g_MtxInvProjection@GlobalsPS@@3V?$matrix@M$03$03@@B", scope: !0, file: !76, line: 50, type: !77, isLocal: false, isDefinition: true)
!168 = !DIGlobalVariable(name: "mrgGlobalLight_Direction_View", linkageName: "\01?mrgGlobalLight_Direction_View@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 51, type: !129, isLocal: false, isDefinition: true)
!169 = !DIGlobalVariable(name: "g_Diffuse", linkageName: "\01?g_Diffuse@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 52, type: !129, isLocal: false, isDefinition: true)
!170 = !DIGlobalVariable(name: "g_Ambient", linkageName: "\01?g_Ambient@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 53, type: !129, isLocal: false, isDefinition: true)
!171 = !DIGlobalVariable(name: "g_Specular", linkageName: "\01?g_Specular@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 54, type: !129, isLocal: false, isDefinition: true)
!172 = !DIGlobalVariable(name: "g_Emissive", linkageName: "\01?g_Emissive@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 55, type: !129, isLocal: false, isDefinition: true)
!173 = !DIGlobalVariable(name: "g_OpacityReflectionRefractionSpectype", linkageName: "\01?g_OpacityReflectionRefractionSpectype@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 56, type: !129, isLocal: false, isDefinition: true)
!174 = !DIGlobalVariable(name: "mrgGroundColor", linkageName: "\01?mrgGroundColor@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 57, type: !129, isLocal: false, isDefinition: true)
!175 = !DIGlobalVariable(name: "mrgSkyColor", linkageName: "\01?mrgSkyColor@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 58, type: !129, isLocal: false, isDefinition: true)
!176 = !DIGlobalVariable(name: "mrgPowerGlossLevel", linkageName: "\01?mrgPowerGlossLevel@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 59, type: !129, isLocal: false, isDefinition: true)
!177 = !DIGlobalVariable(name: "mrgEmissionPower", linkageName: "\01?mrgEmissionPower@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 60, type: !129, isLocal: false, isDefinition: true)
!178 = !DIGlobalVariable(name: "mrgLocalLight0_Position", linkageName: "\01?mrgLocalLight0_Position@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 61, type: !129, isLocal: false, isDefinition: true)
!179 = !DIGlobalVariable(name: "mrgLocalLight0_Color", linkageName: "\01?mrgLocalLight0_Color@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 62, type: !129, isLocal: false, isDefinition: true)
!180 = !DIGlobalVariable(name: "mrgLocalLight0_Range", linkageName: "\01?mrgLocalLight0_Range@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 63, type: !129, isLocal: false, isDefinition: true)
!181 = !DIGlobalVariable(name: "mrgLocalLight0_Attribute", linkageName: "\01?mrgLocalLight0_Attribute@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 64, type: !129, isLocal: false, isDefinition: true)
!182 = !DIGlobalVariable(name: "mrgLocalLight1_Position", linkageName: "\01?mrgLocalLight1_Position@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 65, type: !129, isLocal: false, isDefinition: true)
!183 = !DIGlobalVariable(name: "mrgLocalLight1_Color", linkageName: "\01?mrgLocalLight1_Color@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 66, type: !129, isLocal: false, isDefinition: true)
!184 = !DIGlobalVariable(name: "mrgLocalLight1_Range", linkageName: "\01?mrgLocalLight1_Range@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 67, type: !129, isLocal: false, isDefinition: true)
!185 = !DIGlobalVariable(name: "mrgLocalLight1_Attribute", linkageName: "\01?mrgLocalLight1_Attribute@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 68, type: !129, isLocal: false, isDefinition: true)
!186 = !DIGlobalVariable(name: "mrgLocalLight2_Position", linkageName: "\01?mrgLocalLight2_Position@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 69, type: !129, isLocal: false, isDefinition: true)
!187 = !DIGlobalVariable(name: "mrgLocalLight2_Color", linkageName: "\01?mrgLocalLight2_Color@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 70, type: !129, isLocal: false, isDefinition: true)
!188 = !DIGlobalVariable(name: "mrgLocalLight2_Range", linkageName: "\01?mrgLocalLight2_Range@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 71, type: !129, isLocal: false, isDefinition: true)
!189 = !DIGlobalVariable(name: "mrgLocalLight2_Attribute", linkageName: "\01?mrgLocalLight2_Attribute@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 72, type: !129, isLocal: false, isDefinition: true)
!190 = !DIGlobalVariable(name: "mrgLocalLight3_Position", linkageName: "\01?mrgLocalLight3_Position@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 73, type: !129, isLocal: false, isDefinition: true)
!191 = !DIGlobalVariable(name: "mrgLocalLight3_Color", linkageName: "\01?mrgLocalLight3_Color@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 74, type: !129, isLocal: false, isDefinition: true)
!192 = !DIGlobalVariable(name: "mrgLocalLight3_Range", linkageName: "\01?mrgLocalLight3_Range@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 75, type: !129, isLocal: false, isDefinition: true)
!193 = !DIGlobalVariable(name: "mrgLocalLight3_Attribute", linkageName: "\01?mrgLocalLight3_Attribute@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 76, type: !129, isLocal: false, isDefinition: true)
!194 = !DIGlobalVariable(name: "mrgLocalLight4_Position", linkageName: "\01?mrgLocalLight4_Position@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 77, type: !129, isLocal: false, isDefinition: true)
!195 = !DIGlobalVariable(name: "mrgLocalLight4_Color", linkageName: "\01?mrgLocalLight4_Color@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 78, type: !129, isLocal: false, isDefinition: true)
!196 = !DIGlobalVariable(name: "mrgLocalLight4_Range", linkageName: "\01?mrgLocalLight4_Range@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 79, type: !129, isLocal: false, isDefinition: true)
!197 = !DIGlobalVariable(name: "mrgLocalLight4_Attribute", linkageName: "\01?mrgLocalLight4_Attribute@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 80, type: !129, isLocal: false, isDefinition: true)
!198 = !DIGlobalVariable(name: "mrgEyeLight_Diffuse", linkageName: "\01?mrgEyeLight_Diffuse@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 81, type: !129, isLocal: false, isDefinition: true)
!199 = !DIGlobalVariable(name: "mrgEyeLight_Specular", linkageName: "\01?mrgEyeLight_Specular@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 82, type: !129, isLocal: false, isDefinition: true)
!200 = !DIGlobalVariable(name: "mrgEyeLight_Range", linkageName: "\01?mrgEyeLight_Range@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 83, type: !129, isLocal: false, isDefinition: true)
!201 = !DIGlobalVariable(name: "mrgEyeLight_Attribute", linkageName: "\01?mrgEyeLight_Attribute@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 84, type: !129, isLocal: false, isDefinition: true)
!202 = !DIGlobalVariable(name: "mrgLuminanceRange", linkageName: "\01?mrgLuminanceRange@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 85, type: !129, isLocal: false, isDefinition: true)
!203 = !DIGlobalVariable(name: "mrgInShadowScale", linkageName: "\01?mrgInShadowScale@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 86, type: !129, isLocal: false, isDefinition: true)
!204 = !DIGlobalVariable(name: "g_ShadowMapParams", linkageName: "\01?g_ShadowMapParams@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 87, type: !129, isLocal: false, isDefinition: true)
!205 = !DIGlobalVariable(name: "mrgColourCompressFactor", linkageName: "\01?mrgColourCompressFactor@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 88, type: !129, isLocal: false, isDefinition: true)
!206 = !DIGlobalVariable(name: "g_BackGroundScale", linkageName: "\01?g_BackGroundScale@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 89, type: !129, isLocal: false, isDefinition: true)
!207 = !DIGlobalVariable(name: "g_GIModeParam", linkageName: "\01?g_GIModeParam@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 90, type: !129, isLocal: false, isDefinition: true)
!208 = !DIGlobalVariable(name: "g_GI0Scale", linkageName: "\01?g_GI0Scale@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 91, type: !129, isLocal: false, isDefinition: true)
!209 = !DIGlobalVariable(name: "g_GI1Scale", linkageName: "\01?g_GI1Scale@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 92, type: !129, isLocal: false, isDefinition: true)
!210 = !DIGlobalVariable(name: "g_MotionBlur_AlphaRef_VelocityLimit_VelocityCutoff_BlurMagnitude", linkageName: "\01?g_MotionBlur_AlphaRef_VelocityLimit_VelocityCutoff_BlurMagnitude@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 93, type: !129, isLocal: false, isDefinition: true)
!211 = !DIGlobalVariable(name: "mrgPlayableParam", linkageName: "\01?mrgPlayableParam@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 94, type: !129, isLocal: false, isDefinition: true)
!212 = !DIGlobalVariable(name: "mrgDebugDistortionParam", linkageName: "\01?mrgDebugDistortionParam@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 95, type: !129, isLocal: false, isDefinition: true)
!213 = !DIGlobalVariable(name: "mrgEdgeEmissionParam", linkageName: "\01?mrgEdgeEmissionParam@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 96, type: !129, isLocal: false, isDefinition: true)
!214 = !DIGlobalVariable(name: "g_ForceAlphaColor", linkageName: "\01?g_ForceAlphaColor@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 97, type: !129, isLocal: false, isDefinition: true)
!215 = !DIGlobalVariable(name: "g_MtxInvView", linkageName: "\01?g_MtxInvView@GlobalsPS@@3V?$matrix@M$03$03@@B", scope: !0, file: !76, line: 98, type: !77, isLocal: false, isDefinition: true)
!216 = !DIGlobalVariable(name: "mrgVsmEpsilon", linkageName: "\01?mrgVsmEpsilon@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 99, type: !129, isLocal: false, isDefinition: true)
!217 = !DIGlobalVariable(name: "g_DebugValue", linkageName: "\01?g_DebugValue@GlobalsPS@@3V?$vector@M$03@@B", scope: !0, file: !76, line: 100, type: !129, isLocal: false, isDefinition: true)
!218 = !DIGlobalVariable(name: "g_MtxPrevProjection", linkageName: "\01?g_MtxPrevProjection@GlobalsRT@@3V?$matrix@M$03$03@@B", scope: !0, file: !76, line: 105, type: !77, isLocal: false, isDefinition: true)
!219 = !DIGlobalVariable(name: "g_MtxPrevView", linkageName: "\01?g_MtxPrevView@GlobalsRT@@3V?$matrix@M$03$03@@B", scope: !0, file: !76, line: 106, type: !77, isLocal: false, isDefinition: true)
!220 = !DIGlobalVariable(name: "g_EnvironmentColor", linkageName: "\01?g_EnvironmentColor@GlobalsRT@@3V?$vector@M$02@@B", scope: !0, file: !76, line: 107, type: !221, isLocal: false, isDefinition: true)
!221 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!222 = !DIGlobalVariable(name: "g_BlueNoiseTextureId", linkageName: "\01?g_BlueNoiseTextureId@GlobalsRT@@3IB", scope: !0, file: !76, line: 108, type: !223, isLocal: false, isDefinition: true)
!223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!224 = !DIGlobalVariable(name: "g_PixelJitter", linkageName: "\01?g_PixelJitter@GlobalsRT@@3V?$vector@M$01@@B", scope: !0, file: !76, line: 109, type: !225, isLocal: false, isDefinition: true)
!225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!226 = !DIGlobalVariable(name: "g_BlueNoiseOffset", linkageName: "\01?g_BlueNoiseOffset@GlobalsRT@@3V?$vector@I$01@@B", scope: !0, file: !76, line: 110, type: !227, isLocal: false, isDefinition: true)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!228 = !DIGlobalVariable(name: "g_BVH", linkageName: "\01?g_BVH@@3URaytracingAccelerationStructure@@A", scope: !0, file: !76, line: 113, type: !229, isLocal: false, isDefinition: true)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 113, size: 32, align: 32, elements: !2)
!230 = !DIGlobalVariable(name: "g_GeometryDescs", linkageName: "\01?g_GeometryDescs@@3V?$StructuredBuffer@UGeometryDesc@@@@A", scope: !0, file: !76, line: 114, type: !231, isLocal: false, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<GeometryDesc>", file: !1, line: 114, size: 512, align: 32, elements: !2, templateParams: !232)
!232 = !{!233}
!233 = !DITemplateTypeParameter(name: "element", type: !234)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "GeometryDesc", file: !235, line: 6, size: 512, align: 32, elements: !236)
!235 = !DIFile(filename: "./GeometryDesc.hlsli", directory: "")
!236 = !{!237, !238, !239, !240, !241, !242, !243, !244, !245, !247, !248, !249, !250}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !234, file: !235, line: 8, baseType: !52, size: 32, align: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "IndexBufferId", scope: !234, file: !235, line: 9, baseType: !52, size: 32, align: 32, offset: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "VertexBufferId", scope: !234, file: !235, line: 10, baseType: !52, size: 32, align: 32, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "VertexStride", scope: !234, file: !235, line: 11, baseType: !52, size: 32, align: 32, offset: 96)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "PositionOffset", scope: !234, file: !235, line: 12, baseType: !52, size: 32, align: 32, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "NormalOffset", scope: !234, file: !235, line: 13, baseType: !52, size: 32, align: 32, offset: 160)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "TangentOffset", scope: !234, file: !235, line: 14, baseType: !52, size: 32, align: 32, offset: 192)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "BinormalOffset", scope: !234, file: !235, line: 15, baseType: !52, size: 32, align: 32, offset: 224)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoordOffsets", scope: !234, file: !235, line: 16, baseType: !246, size: 128, align: 32, offset: 256)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 128, align: 32, elements: !140)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ColorOffset", scope: !234, file: !235, line: 17, baseType: !52, size: 32, align: 32, offset: 384)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialId", scope: !234, file: !235, line: 18, baseType: !52, size: 32, align: 32, offset: 416)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "Padding0", scope: !234, file: !235, line: 19, baseType: !52, size: 32, align: 32, offset: 448)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "Padding1", scope: !234, file: !235, line: 20, baseType: !52, size: 32, align: 32, offset: 480)
!251 = !DIGlobalVariable(name: "g_Materials", linkageName: "\01?g_Materials@@3V?$StructuredBuffer@UMaterial@@@@A", scope: !0, file: !76, line: 115, type: !252, isLocal: false, isDefinition: true)
!252 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<Material>", file: !1, line: 115, size: 2304, align: 32, elements: !2, templateParams: !253)
!253 = !{!254}
!254 = !DITemplateTypeParameter(name: "element", type: !255)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !256, line: 4, size: 2304, align: 32, elements: !257)
!256 = !DIFile(filename: "./MaterialData.hlsli", directory: "")
!257 = !{!258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "ShaderType", scope: !255, file: !256, line: 6, baseType: !52, size: 32, align: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "DiffuseTexture", scope: !255, file: !256, line: 7, baseType: !52, size: 32, align: 32, offset: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "DiffuseTexture2", scope: !255, file: !256, line: 8, baseType: !52, size: 32, align: 32, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "SpecularTexture", scope: !255, file: !256, line: 9, baseType: !52, size: 32, align: 32, offset: 96)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "SpecularTexture2", scope: !255, file: !256, line: 10, baseType: !52, size: 32, align: 32, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "GlossTexture", scope: !255, file: !256, line: 11, baseType: !52, size: 32, align: 32, offset: 160)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "GlossTexture2", scope: !255, file: !256, line: 12, baseType: !52, size: 32, align: 32, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "NormalTexture", scope: !255, file: !256, line: 13, baseType: !52, size: 32, align: 32, offset: 224)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "NormalTexture2", scope: !255, file: !256, line: 14, baseType: !52, size: 32, align: 32, offset: 256)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "ReflectionTexture", scope: !255, file: !256, line: 15, baseType: !52, size: 32, align: 32, offset: 288)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "OpacityTexture", scope: !255, file: !256, line: 16, baseType: !52, size: 32, align: 32, offset: 320)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "DisplacementTexture", scope: !255, file: !256, line: 17, baseType: !52, size: 32, align: 32, offset: 352)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoordOffsets", scope: !255, file: !256, line: 19, baseType: !271, size: 256, align: 32, offset: 384)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, align: 32, elements: !144)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !255, file: !256, line: 20, baseType: !4, size: 128, align: 32, offset: 640)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "Ambient", scope: !255, file: !256, line: 21, baseType: !4, size: 128, align: 32, offset: 768)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !255, file: !256, line: 22, baseType: !4, size: 128, align: 32, offset: 896)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "Emissive", scope: !255, file: !256, line: 23, baseType: !4, size: 128, align: 32, offset: 1024)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "PowerGlossLevel", scope: !255, file: !256, line: 24, baseType: !4, size: 128, align: 32, offset: 1152)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "OpacityReflectionRefractionSpectype", scope: !255, file: !256, line: 25, baseType: !4, size: 128, align: 32, offset: 1280)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "LuminanceRange", scope: !255, file: !256, line: 26, baseType: !4, size: 128, align: 32, offset: 1408)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "FresnelParam", scope: !255, file: !256, line: 27, baseType: !4, size: 128, align: 32, offset: 1536)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "SonicEyeHighLightPosition", scope: !255, file: !256, line: 28, baseType: !4, size: 128, align: 32, offset: 1664)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "SonicEyeHighLightColor", scope: !255, file: !256, line: 29, baseType: !4, size: 128, align: 32, offset: 1792)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "SonicSkinFalloffParam", scope: !255, file: !256, line: 30, baseType: !4, size: 128, align: 32, offset: 1920)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ChrEmissionParam", scope: !255, file: !256, line: 31, baseType: !4, size: 128, align: 32, offset: 2048)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "EmissionParam", scope: !255, file: !256, line: 36, baseType: !4, size: 128, align: 32, offset: 2176)
!285 = !DIGlobalVariable(name: "g_ColorTexture", linkageName: "\01?g_ColorTexture@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !76, line: 117, type: !286, isLocal: false, isDefinition: true)
!286 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 117, size: 128, align: 32, elements: !2, templateParams: !287)
!287 = !{!288}
!288 = !DITemplateTypeParameter(name: "element", type: !5)
!289 = !DIGlobalVariable(name: "g_DepthTexture", linkageName: "\01?g_DepthTexture@@3V?$RWTexture2D@M@@A", scope: !0, file: !76, line: 118, type: !290, isLocal: false, isDefinition: true)
!290 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<float>", file: !1, line: 118, size: 32, align: 32, elements: !2, templateParams: !291)
!291 = !{!13}
!292 = !DIGlobalVariable(name: "g_MotionVectorsTexture", linkageName: "\01?g_MotionVectorsTexture@@3V?$RWTexture2D@V?$vector@M$01@@@@A", scope: !0, file: !76, line: 119, type: !293, isLocal: false, isDefinition: true)
!293 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 2> >", file: !1, line: 119, size: 64, align: 32, elements: !2, templateParams: !294)
!294 = !{!295}
!295 = !DITemplateTypeParameter(name: "element", type: !17)
!296 = !DIGlobalVariable(name: "g_PositionAndFlagsTexture", linkageName: "\01?g_PositionAndFlagsTexture@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !76, line: 121, type: !286, isLocal: false, isDefinition: true)
!297 = !DIGlobalVariable(name: "g_NormalTexture", linkageName: "\01?g_NormalTexture@@3V?$RWTexture2D@V?$vector@M$02@@@@A", scope: !0, file: !76, line: 122, type: !298, isLocal: false, isDefinition: true)
!298 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 3> >", file: !1, line: 122, size: 96, align: 32, elements: !2, templateParams: !299)
!299 = !{!300}
!300 = !DITemplateTypeParameter(name: "element", type: !45)
!301 = !DIGlobalVariable(name: "g_DiffuseTexture", linkageName: "\01?g_DiffuseTexture@@3V?$RWTexture2D@V?$vector@M$02@@@@A", scope: !0, file: !76, line: 123, type: !298, isLocal: false, isDefinition: true)
!302 = !DIGlobalVariable(name: "g_SpecularTexture", linkageName: "\01?g_SpecularTexture@@3V?$RWTexture2D@V?$vector@M$02@@@@A", scope: !0, file: !76, line: 124, type: !298, isLocal: false, isDefinition: true)
!303 = !DIGlobalVariable(name: "g_SpecularPowerTexture", linkageName: "\01?g_SpecularPowerTexture@@3V?$RWTexture2D@M@@A", scope: !0, file: !76, line: 125, type: !290, isLocal: false, isDefinition: true)
!304 = !DIGlobalVariable(name: "g_SpecularLevelTexture", linkageName: "\01?g_SpecularLevelTexture@@3V?$RWTexture2D@M@@A", scope: !0, file: !76, line: 126, type: !290, isLocal: false, isDefinition: true)
!305 = !DIGlobalVariable(name: "g_EmissionTexture", linkageName: "\01?g_EmissionTexture@@3V?$RWTexture2D@V?$vector@M$02@@@@A", scope: !0, file: !76, line: 127, type: !298, isLocal: false, isDefinition: true)
!306 = !DIGlobalVariable(name: "g_FalloffTexture", linkageName: "\01?g_FalloffTexture@@3V?$RWTexture2D@V?$vector@M$02@@@@A", scope: !0, file: !76, line: 128, type: !298, isLocal: false, isDefinition: true)
!307 = !DIGlobalVariable(name: "g_ShadowTexture", linkageName: "\01?g_ShadowTexture@@3V?$RWTexture2D@M@@A", scope: !0, file: !76, line: 130, type: !290, isLocal: false, isDefinition: true)
!308 = !DIGlobalVariable(name: "g_GlobalIlluminationTexture", linkageName: "\01?g_GlobalIlluminationTexture@@3V?$RWTexture2D@V?$vector@M$02@@@@A", scope: !0, file: !76, line: 131, type: !298, isLocal: false, isDefinition: true)
!309 = !DIGlobalVariable(name: "g_ReflectionTexture", linkageName: "\01?g_ReflectionTexture@@3V?$RWTexture2D@V?$vector@M$02@@@@A", scope: !0, file: !76, line: 132, type: !298, isLocal: false, isDefinition: true)
!310 = !{i32 2, !"Dwarf Version", i32 4}
!311 = !{i32 2, !"Debug Info Version", i32 3}
